/*

练习 1
用 for 循环输出 1 到 100。

但是只要遇到第一个能被 7 和 11 同时整除的数，就输出它并结束整个循环。

*/

#include <stdio.h>

int main(void){

    for(int i = 1; i <= 100 ; i++){

        if(i % 7 == 0 && i % 11 == 0){

            printf("%d\n", i);
            break;

        }
        
        printf("%d\n", i);

    }

    return 0;

}

/*

运行结果:
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71                                                                                                                                                                                                                                                                                                   
72                                                                                                                                                                                                                                                                                                   
73                                                                                                                                                                                                                                                                                                   
74                                                                                                                                                                                                                                                                                                   
75                                                                                                                                                                                                                                                                                                   
76                                                                                                                                                                                                                                                                                                   
77

*/