/*

练习 4 要求：

用 for 循环输出 1 到 100 之间所有的偶数。

提示：想想循环变量每次加几最合适。（不需要用 if 判断）

*/

#include <stdio.h>

int main(void){

    for(int i = 2; i <= 100; i+= 2){

        printf("%d\n", i);

    }

    return 0;

}


/*

运行结果:
2                                                                                                                                                                                                                                                                                                    
4                                                                                                                                                                                                                                                                                                    
6                                                                                                                                                                                                                                                                                                    
8                                                                                                                                                                                                                                                                                                    
10
12
14
16
18
20
22
24
26
28
30
32
34
36
38
40
42
44
46
48
50
52
54
56
58
60
62
64
66
68
70
72
74
76
78
80
82
84
86
88                                                                                                                                                                                                                                                                                                   
90                                                                                                                                                                                                                                                                                                   
92                                                                                                                                                                                                                                                                                                   
94                                                                                                                                                                                                                                                                                                   
96                                                                                                                                                                                                                                                                                                   
98                                                                                                                                                                                                                                                                                                   
100 

*/