/*

独立练习任务 (ex2ConditionalCompile.c)
要求自己写出下面的逻辑：

在文件最顶部（#include 下面），写一句 #define DEBUG （注意，宏后面什么值都不用写，就是个标记）。

在 main 里，写以下逻辑：

一个 #ifdef DEBUG 判断。

如果条件成立，打印 "正在调试模式运行..."。

用 #endif 结束。

在 #endif 的下面，写一句 printf("程序主体运行完毕。\n");。

编译运行，看看屏幕输出什么。

关键一步：回到代码，把第一行的 #define DEBUG 注释掉，重新编译运行。看看输出有什么不同。

*/

#include <stdio.h>



int main (void){

    #ifdef DEBUG
        printf("程序正在调试运行...\n");
    #endif

    printf("程序主体运行完毕\n");

    return 0;

}

/*

	概述（1）
第2章	程序设计起步（26）
第3章	会思考的程序——选择结构（53）
第4章	键盘输入与屏幕输出（85）
第5章	周而复始——循环结构（102）
第6章	模块化设计——函数（137）
第7章	编译前的预备动作——预处理（169）
第8章	批量数据的处理——数组（182）
8.1 平均成绩和通过率（182）
第9章	文本的处理——字符串（212）
第10章	间接访问数据——指针（235）
第11章	自定义数据类型——结构体、共用体和枚举类型（264）
第12章	数据持久化——文件（295）
第二部分：程序设计高级进阶	
第13章	百变超人——指针的高级应用（315）
第14章	动态存储结构——链表（341）
第15章	C语言程序设计实例——学生成绩管理系统（364）

*/